// 5.  Задано 3 числа (a, b, c), які не рівні між собою.
//     Визначити середнє мід цими трьома числами
//     (не середнє арифметичне значення, а яке з трьох заданих чисел среднє за значенням) використовуючи оператор if-else.
//     Використати вкладені оператори if
//     Результат виводити в консоль.

let a = 100
let b = 200
let c = 300

if (a >= b){
    console.log("Error")
} else if (b >= c){
    console.log('Error')
} else if (a >= c){
    console.log("Error")
} else{
    console.log(b)
}

