// 9.*  Використовуючи оператор if реалізувати логіку переводу метрів в кілометри,
//     так щоб в консоль виводився результат обчислень з правильним закінченням.
//     Наприклад: 1000 метрів це 1 кілометр;  32 метри це 0,032 кілометра і т.д.

let km = 0.032
let m = 32
let end = 'ів'
let end1 = 'и'
let end2 = 'а'

if (m == 1000 && km == 1){
    console.log(m + ` метр${end} це `+ km +' кілометр')
} else if (m == 32 && km == 0.032) {
    console.log( `32 метр${end1} це ` + ` 0,032 кілометр${end2}`)
}









 